{
  "title": "Privacy & Cookie Policy",
  "subtitle": "For Registered Users and App Users",
  "effectiveDate": "October, 2025",
  "version": "1",
  "sections": [
    {
      "id": "introduction",
      "title": "Introduction",
      "content": [
        "This Privacy & Cookie Policy explains how Metromellow Ltd ('we', 'us', 'our') collects, uses, stores, and protects the personal information of registered users who create accounts and use our services through our Platform.",
        "This policy applies specifically to individuals who have registered for an account on the Metromellow platform and actively use our services.",
        "By creating an account and using our services, you acknowledge that you have read, understood, and agree to this Privacy & Cookie Policy."
      ]
    },
    {
      "id": "information-collected",
      "title": "Information We Collect",
      "content": [],
      "listItems": [
        "**Personal Information:** When you register for an account, we collect information including but not limited to: full name, email address, phone number, residential address, date of birth, and government-issued identification documents for verification purposes.",
        "**Payment Information:** We collect payment card details, bank account information, and transaction history necessary to process payments for our services.",
        "**Service Usage Data:** We collect information about the services you book, service preferences, scheduling information, and communication with our personnel.",
        "**Technical Data:** We automatically collect device information, IP addresses, browser type, operating system, and app usage analytics.",
        "**Location Data:** With your permission, we collect precise location data to facilitate service delivery and improve user experience."
      ]
    },
    {
      "id": "how-we-use",
      "title": "How We Use Your Information",
      "content": [],
      "listItems": [
        "**Service Delivery:** To provide, maintain, and improve our services, process bookings, and facilitate communication between you and our service personnel.",
        "**Account Management:** To create and manage your account, verify your identity, and maintain account security.",
        "**Payment Processing:** To process payments, prevent fraud, and maintain financial records.",
        "**Communication:** To send service updates, booking confirmations, promotional offers (with your consent), and important notices about our services.",
        "**Platform Improvement:** To analyze usage patterns, conduct research, develop new features, and enhance user experience.",
        "**Legal Compliance:** To comply with legal obligations, enforce our terms and conditions, and protect our rights and the rights of our users."
      ]
    },
    {
      "id": "data-sharing",
      "title": "Data Sharing and Disclosure",
      "content": [],
      "listItems": [
        "**Service Personnel:** We share necessary information with our personnel assigned to fulfill your service requests.",
        "**Payment Processors:** We share payment information with third-party payment service providers to process transactions securely.",
        "**Service Providers:** We may share data with trusted third-party service providers who assist us in operating our platform, conducting business, or servicing you.",
        "**Legal Requirements:** We may disclose your information when required by law, court order, or government request, or to protect our rights, property, or safety.",
        "**Business Transfers:** In the event of a merger, acquisition, or sale of assets, your information may be transferred to the acquiring entity.",
        "**With Your Consent:** We may share your information with third parties when you have given us explicit consent to do so."
      ]
    },
    {
      "id": "data-security",
      "title": "Data Security",
      "content": [
        "We implement appropriate technical and organizational security measures to protect your personal information against unauthorized access, alteration, disclosure, or destruction.",
        "Security measures include encryption of data in transit and at rest, secure server infrastructure, regular security audits, and restricted access to personal information on a need-to-know basis.",
        "While we strive to protect your personal information, no method of transmission over the internet or electronic storage is 100% secure. We cannot guarantee absolute security but commit to promptly addressing any security breaches.",
        "You are responsible for maintaining the confidentiality of your account credentials and for all activities that occur under your account."
      ]
    },
    {
      "id": "data-retention",
      "title": "Data Retention",
      "content": [
        "We retain your personal information for as long as your account is active or as needed to provide you services.",
        "We will retain and use your information as necessary to comply with legal obligations, resolve disputes, enforce our agreements, and maintain business records.",
        "If you wish to delete your account, you may do so through your account settings. Following account deletion, we will delete or anonymize your personal information within 90 days, except where retention is required by law.",
        "Financial and transaction records may be retained for longer periods as required by applicable tax and accounting regulations."
      ]
    },
    {
      "id": "your-rights",
      "title": "Your Rights and Choices",
      "content": [],
      "listItems": [
        "**Access and Update:** You have the right to access, review, and update your personal information through your account settings.",
        "**Data Portability:** You can request a copy of your personal data in a structured, commonly used format.",
        "**Deletion:** You can request deletion of your account and personal information, subject to legal retention requirements.",
        "**Consent Withdrawal:** You can withdraw consent for marketing communications, location tracking, and other optional data processing activities.",
        "**Objection:** You have the right to object to certain types of data processing, including automated decision-making.",
        "**Complaint:** You have the right to lodge a complaint with the Nigeria Data Protection Commission if you believe your privacy rights have been violated."
      ]
    },
    {
      "id": "cookies",
      "title": "Cookie Policy",
      "content": [
        "**What Are Cookies:** Cookies are small text files stored on your device when you visit our website or use our app. They help us recognize your device, remember your preferences, and improve your experience."
      ],
      "listItems": [
        "**Essential Cookies:** Necessary for platform functionality.",
        "**Performance Cookies:** Help us understand how users interact with our platform.",
        "**Functional Cookies:** Remember your preferences and settings.",
        "**Targeting/Advertising Cookies:** Used to deliver relevant advertisements."
      ],
      "contentAfterList": [
        "**Third-Party Cookies:** We may allow trusted third parties to place cookies on your device for analytics, advertising, and other purposes.",
        "**Managing Cookies:** You can control and manage cookies through your browser settings. However, disabling certain cookies may affect platform functionality and your user experience.",
        "**Mobile App Tracking:** Our mobile app may use similar tracking technologies. You can manage these through your device settings."
      ]
    },
    {
      "id": "children-privacy",
      "title": "Children's Privacy",
      "content": [
        "Our services are not intended for individuals under the age of 18. We do not knowingly collect personal information from children.",
        "If we become aware that we have inadvertently collected personal information from a child, we will take steps to delete such information promptly.",
        "Parents or guardians who believe we may have collected information from a child should contact us immediately."
      ]
    },
    {
      "id": "international-transfers",
      "title": "International Data Transfers",
      "content": [
        "Your personal information is primarily stored and processed in Nigeria.",
        "If we transfer data outside Nigeria, we ensure appropriate safeguards are in place to protect your information in accordance with applicable data protection laws.",
        "By using our services, you consent to the transfer of your information to countries outside Nigeria where necessary for service provision."
      ]
    },
    {
      "id": "policy-updates",
      "title": "Changes to This Policy",
      "content": [
        "We may update this Privacy & Cookie Policy from time to time to reflect changes in our practices, technologies, legal requirements, or other factors.",
        "We will notify you of material changes through email, in-app notifications, or prominent notices on our platform.",
        "Your continued use of our services after such changes constitutes acceptance of the updated policy.",
        "We encourage you to review this policy periodically to stay informed about how we protect your information."
      ]
    },
    {
      "id": "contact",
      "title": "Contact Us",
      "content": [
        "If you have questions, concerns, or requests regarding this Privacy & Cookie Policy or our data practices, please contact us:"
      ],
      "listItems": [
        "**Email:** privacy@metromellow.com",
        "**Phone:** +2347049452585",
        "**Address:** [Insert physical address]",
        "**Data Protection Officer:** [Insert DPO contact details]"
      ]
    }
  ]
}
